#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.ebs_csi_irsa_role.data.aws_caller_identity.current: Reading...
module.ebs_csi_irsa_role.data.aws_partition.current: Reading...
module.kms.data.aws_partition.current[0]: Reading...
data.aws_ecrpublic_authorization_token.token: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/dev-cluster/cluster]
module.karpenter.data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.ebs_csi_irsa_role.data.aws_region.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0af5764d9af4176f1]
aws_s3_bucket.s3_backend_bucket: Refreshing state... [id=unique-bucket-name-msctf]
module.ebs_csi_irsa_role.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
module.ebs_csi_irsa_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.karpenter.data.aws_region.current: Reading...
data.aws_eks_addon_version.ebs_csi: Reading...
data.aws_caller_identity.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.karpenter.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.karpenter.data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=819195744]
module.kms.data.aws_caller_identity.current[0]: Reading...
module.ebs_csi_irsa_role.data.aws_caller_identity.current: Read complete after 0s [id=771700505853]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=dev-cluster-cluster-20241124200256533400000001]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=771700505853]
module.karpenter.aws_iam_role.controller[0]: Refreshing state... [id=KarpenterController-20241124200256534500000002]
data.aws_caller_identity.current: Read complete after 0s [id=771700505853]
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::771700505853:user/terraform-user]
module.karpenter.data.aws_caller_identity.current: Read complete after 0s [id=771700505853]
module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=771700505853]
module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3274443241]
module.kms.aws_kms_key.this[0]: Refreshing state... [id=dc58e291-ae5a-4f86-af58-a134b6ac18bf]
data.aws_ecrpublic_authorization_token.token: Read complete after 0s [id=us-east-1]
data.aws_eks_addon_version.ebs_csi: Read complete after 0s [id=aws-ebs-csi-driver]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=dev-cluster-cluster-20241124200256533400000001-20241124200256887300000004]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=dev-cluster-cluster-20241124200256533400000001-20241124200256808000000003]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-state-locking]
module.kms.aws_kms_alias.this["eks/dev-cluster"]: Refreshing state... [id=alias/eks/dev-cluster]
module.eks.module.eks_managed_node_group["first"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["first"].data.aws_partition.current: Reading...
module.ebs_csi_irsa_role.data.aws_iam_policy_document.ebs_csi[0]: Reading...
module.eks.module.eks_managed_node_group["first"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::771700505853:policy/dev-cluster-cluster-ClusterEncryption2024112420031640490000000c]
module.eks.module.eks_managed_node_group["first"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["first"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.ebs_csi_irsa_role.data.aws_iam_policy_document.ebs_csi[0]: Read complete after 0s [id=2896522642]
module.eks.module.eks_managed_node_group["first"].aws_iam_role.this[0]: Refreshing state... [id=node-grp-1-eks-node-group-2024112420031640420000000b]
module.ebs_csi_irsa_role.aws_iam_policy.ebs_csi[0]: Refreshing state... [id=arn:aws:iam::771700505853:policy/AmazonEKS_EBS_CSI_Policy-2024112420031638720000000a]
module.eks.module.eks_managed_node_group["first"].data.aws_caller_identity.current: Read complete after 0s [id=771700505853]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=dev-cluster-cluster-20241124200256533400000001-2024112420031668560000000d]
module.eks.module.eks_managed_node_group["first"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=node-grp-1-eks-node-group-2024112420031640420000000b-2024112420031668620000000e]
module.eks.module.eks_managed_node_group["first"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=node-grp-1-eks-node-group-2024112420031640420000000b-20241124200316802700000010]
module.eks.module.eks_managed_node_group["first"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=node-grp-1-eks-node-group-2024112420031640420000000b-2024112420031669250000000f]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0d383c34301ddbc79]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0b45c9a77dfa60dd9]
module.vpc.aws_route_table.intra[0]: Refreshing state... [id=rtb-043c723e1e408a370]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0407a29d644b41d2d]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0f20eb3a0a66132ee]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-014fa5d97f751d526]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c7dda02601a7e93e]
aws_security_group.terraform-dev-vpc: Refreshing state... [id=sg-0013b1b5ceb82327e]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04ac862d8bf281236]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0dd5a27cb60faf07d]
module.vpc.aws_subnet.intra[0]: Refreshing state... [id=subnet-007588156bae3e547]
module.vpc.aws_subnet.intra[1]: Refreshing state... [id=subnet-0e86ecf2ed3682e49]
module.vpc.aws_subnet.intra[2]: Refreshing state... [id=subnet-0bd5db949f7593c96]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-03efd2d6ada8726b3]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0d76d1a9747bb70e2]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-0bd361ea5d586eccf]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-00e24b893b829c9f9]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-02ebaee545d084736]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-04517cbfeb0b65b19]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-003266e3b4069caeb]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ae82876d921f9d1a]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-047de9e7f7ae45db2]
aws_s3_bucket_versioning.terraform_bucket_versioning: Refreshing state... [id=unique-bucket-name-msctf]
aws_s3_bucket_public_access_block.terraform_bucket_public_access: Refreshing state... [id=unique-bucket-name-msctf]
aws_s3_bucket_lifecycle_configuration.terraform_bucket_lifecycle: Refreshing state... [id=unique-bucket-name-msctf]
aws_s3_bucket_server_side_encryption_configuration.terraform_state_crypto_conf: Refreshing state... [id=unique-bucket-name-msctf]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0b45c9a77dfa60dd91080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0891c8bd4a1326b0f]
aws_vpc_security_group_ingress_rule.terraform-dev-vpc-ssh: Refreshing state... [id=sgr-06ded5d11ff1b3d32]
aws_vpc_security_group_ingress_rule.terraform-dev-vpc-http: Refreshing state... [id=sgr-089ef6dbdc2455888]
aws_vpc_security_group_ingress_rule.terraform-dev-vpc-https: Refreshing state... [id=sgr-08c316f066a022692]
module.vpc.aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-05d06d7790a43d455]
module.vpc.aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-088652f73c285201d]
module.vpc.aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-02f89569df1df66f6]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=dev-vpc]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-014798c33f0249a89]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-060a041f5a6b4f44c]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0cac842c09dc0b046]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2014565922]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-481346277]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1689587877]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3102695690]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-752801678]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3333209694]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-481486313]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-267311560]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3152837968]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2810665386]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-061e9fc6590e9f7b1]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0f59d0327d4490465]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b92b73469e99ce63]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-356991479]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ef09e639b21c6fcf]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0113308ea857975dc]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08944aa06a1753aab]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0aabbb95ed1564e66]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c7dda02601a7e93e1080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=dev-cluster]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.aws_eks_access_entry.this["example"]: Refreshing state... [id=dev-cluster:arn:aws:iam::771700505853:user/Aws_admin_Sani]
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=dev-cluster:arn:aws:iam::771700505853:user/terraform-user]
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-11-24T20:14:31Z]
module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-09a1c0ac6677aacdc,Environment]
module.eks.aws_ec2_tag.cluster_primary_security_group["Terraform"]: Refreshing state... [id=sg-09a1c0ac6677aacdc,Terraform]
module.eks.aws_ec2_tag.cluster_primary_security_group["karpenter.sh/discovery"]: Refreshing state... [id=sg-09a1c0ac6677aacdc,karpenter.sh/discovery]
module.eks.module.eks_managed_node_group["first"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=8598492373295555838]
module.eks.module.eks_managed_node_group["first"].aws_launch_template.this[0]: Refreshing state... [id=lt-0505cbf9c783f87ac]
module.eks.module.eks_managed_node_group["first"].aws_eks_node_group.this[0]: Refreshing state... [id=dev-cluster:node-grp-1-20241124201437053700000021]
module.eks.data.tls_certificate.this[0]: Read complete after 1s [id=99d41e43229a4cdaf4141f3e8310e6d95c31dab9]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::771700505853:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/3B8BC7C8A8220B7B1EDAF9D3B3DC6613]
module.ebs_csi_irsa_role.data.aws_iam_policy_document.this[0]: Reading...
module.ebs_csi_irsa_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2193078327]
module.ebs_csi_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=one-ebs-csi]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=dev-cluster#arn:aws:iam::771700505853:user/terraform-user#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.aws_eks_access_policy_association.this["example_example"]: Refreshing state... [id=dev-cluster#arn:aws:iam::771700505853:user/Aws_admin_Sani#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Reading...
module.ebs_csi_irsa_role.aws_iam_role_policy_attachment.ebs_csi[0]: Refreshing state... [id=one-ebs-csi-20241124201401979600000012]
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Read complete after 0s [id=eks-pod-identity-agent]
module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20241124201403263000000015]
module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20241124201403263800000016]
module.karpenter.aws_cloudwatch_event_rule.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20241124201403261800000014]
module.karpenter.aws_eks_pod_identity_association.karpenter[0]: Refreshing state... [id=a-fyhs5mcnhfx8tc5xo]
module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20241124201403261100000013]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.karpenter.aws_iam_role.node[0]: Refreshing state... [id=Karpenter-dev-cluster-20241124201403268600000018]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.karpenter.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/771700505853/Karpenter-dev-cluster]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]
module.eks.aws_eks_addon.this["eks-pod-identity-agent"]: Refreshing state... [id=dev-cluster:eks-pod-identity-agent]
module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=dev-cluster:aws-ebs-csi-driver]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=dev-cluster:coredns]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=dev-cluster:kube-proxy]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=dev-cluster:vpc-cni]
module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=Karpenter-dev-cluster-20241124201403268600000018-2024112420140360550000001c]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=Karpenter-dev-cluster-20241124201403268600000018-20241124201403549000000019]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"]: Refreshing state... [id=Karpenter-dev-cluster-20241124201403268600000018-2024112420140358760000001b]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=Karpenter-dev-cluster-20241124201403268600000018-2024112420140358200000001a]
module.karpenter.data.aws_iam_policy_document.queue[0]: Reading...
module.karpenter.data.aws_iam_policy_document.queue[0]: Read complete after 0s [id=2721009497]
module.karpenter.data.aws_iam_policy_document.v033[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v033[0]: Read complete after 0s [id=581386682]
module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20241124201403263000000015-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20241124201403261100000013-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20241124201403261800000014-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20241124201403263800000016-KarpenterInterruptionQueueTarget]
module.karpenter.aws_sqs_queue_policy.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/771700505853/Karpenter-dev-cluster]
module.karpenter.data.aws_iam_policy_document.v1[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v1[0]: Read complete after 0s [id=2257186105]
data.aws_eks_cluster_auth.cluster: Reading...
data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=dev-cluster]
module.karpenter.data.aws_iam_policy_document.controller[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller[0]: Read complete after 0s [id=2257186105]
module.karpenter.aws_eks_access_entry.node[0]: Refreshing state... [id=dev-cluster:arn:aws:iam::771700505853:role/Karpenter-dev-cluster-20241124201403268600000018]
module.karpenter.aws_iam_policy.controller[0]: Refreshing state... [id=arn:aws:iam::771700505853:policy/KarpenterController-2024112420142861730000001d]
helm_release.karpenter: Refreshing state... [id=karpenter]
module.karpenter.aws_iam_role_policy_attachment.controller[0]: Refreshing state... [id=KarpenterController-20241124200256534500000002-2024112420142886870000001e]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks_managed_node_group["first"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "dev-cluster:node-grp-1-20241124201437053700000021"
      + labels                 = {}
        tags                   = {
            "Environment"            = "dev"
            "Name"                   = "node-grp-1"
            "Terraform"              = "true"
            "karpenter.sh/discovery" = "dev-cluster"
        }
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "cluster" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "dev-cluster"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
      + zonal_shift_config        = (known after apply)
    }

  # helm_release.karpenter will be updated in-place
  ~ resource "helm_release" "karpenter" {
        id                         = "karpenter"
        name                       = "karpenter"
      ~ repository_password        = (sensitive value)
        # (29 unchanged attributes hidden)
    }

  # kubectl_manifest.ebs_csi_default_storage_class will be created
  + resource "kubectl_manifest" "ebs_csi_default_storage_class" {
      + api_version             = "storage.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "StorageClass"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "gp3-default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            allowVolumeExpansion: true
            apiVersion: storage.k8s.io/v1
            kind: StorageClass
            metadata:
              annotations:
                storageclass.kubernetes.io/is-default-class: "true"
              name: gp3-default
            parameters:
              encrypted: "true"
              fsType: ext4
              kmsKeyId: arn:aws:kms:us-east-1:771700505853:key/dc58e291-ae5a-4f86-af58-a134b6ac18bf
              type: gp3
            provisioner: ebs.csi.aws.com
            reclaimPolicy: Delete
            volumeBindingMode: WaitForFirstConsumer
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.karpenter_node_class will be created
  + resource "kubectl_manifest" "karpenter_node_class" {
      + api_version             = "karpenter.k8s.aws/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "EC2NodeClass"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.k8s.aws/v1
            kind: EC2NodeClass
            metadata:
              name: default
            spec:
              amiFamily: AL2023
              amiSelectorTerms:
              - id: ami-09c6d3a030e81a3ad
              - id: ami-0eff9a20e584c7411
              role: Karpenter-dev-cluster-20241124201403268600000018
              securityGroupSelectorTerms:
              - tags:
                  karpenter.sh/discovery: dev-cluster
              subnetSelectorTerms:
              - tags:
                  karpenter.sh/discovery: dev-cluster
              tags:
                karpenter.sh/discovery: dev-cluster
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.karpenter_node_pool will be created
  + resource "kubectl_manifest" "karpenter_node_pool" {
      + api_version             = "karpenter.sh/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NodePool"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1
            kind: NodePool
            metadata:
              name: default
            spec:
              disruption:
                consolidateAfter: 30s
                consolidationPolicy: WhenEmptyOrUnderutilized
              limits:
                cpu: 1000
              template:
                spec:
                  expireAfter: 72h
                  nodeClassRef:
                    group: karpenter.k8s.aws
                    kind: EC2NodeClass
                    name: default
                  requirements:
                  - key: kubernetes.io/arch
                    operator: In
                    values:
                    - amd64
                  - key: kubernetes.io/os
                    operator: In
                    values:
                    - linux
                  - key: karpenter.sh/capacity-type
                    operator: In
                    values:
                    - spot
                    - on-demand
                  - key: karpenter.k8s.aws/instance-category
                    operator: In
                    values:
                    - c
                    - m
                    - t
                  - key: karpenter.k8s.aws/instance-generation
                    operator: Gt
                    values:
                    - "2"
                  - key: karpenter.k8s.aws/instance-cpu
                    operator: In
                    values:
                    - "2"
                    - "4"
                    - "8"
                    - "16"
                    - "32"
                  - key: karpenter.k8s.aws/instance-hypervisor
                    operator: In
                    values:
                    - nitro
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.eks.aws_eks_access_entry.this["example"] must be replaced
-/+ resource "aws_eks_access_entry" "this" {
      ~ access_entry_arn  = "arn:aws:eks:us-east-1:771700505853:access-entry/dev-cluster/user/771700505853/Aws_admin_Sani/b2c9afe7-a69e-e901-fe00-67b82a7f3e31" -> (known after apply)
      ~ created_at        = "2024-11-24T20:14:01Z" -> (known after apply)
      ~ id                = "dev-cluster:arn:aws:iam::771700505853:user/Aws_admin_Sani" -> (known after apply)
      ~ kubernetes_groups = [] -> (known after apply)
      ~ modified_at       = "2024-11-24T20:14:01Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::771700505853:user/Aws_admin_Sani" -> "arn:aws:iam::771700505853:user/terraform-user" # forces replacement
        tags              = {
            "Environment"            = "dev"
            "Terraform"              = "true"
            "karpenter.sh/discovery" = "dev-cluster"
        }
      ~ user_name         = "arn:aws:iam::771700505853:user/Aws_admin_Sani" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_policy_association.this["example_example"] must be replaced
-/+ resource "aws_eks_access_policy_association" "this" {
      ~ associated_at = "2024-11-24 20:14:02.722 +0000 UTC" -> (known after apply)
      ~ id            = "dev-cluster#arn:aws:iam::771700505853:user/Aws_admin_Sani#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2024-11-24 20:14:02.722 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::771700505853:user/Aws_admin_Sani" -> "arn:aws:iam::771700505853:user/terraform-user" # forces replacement
        # (2 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "dc58e291-ae5a-4f86-af58-a134b6ac18bf"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::771700505853:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::771700505853:user/terraform-user",
                              - "arn:aws:iam::771700505853:user/Aws_admin_Sani",
                            ] -> "arn:aws:iam::771700505853:user/terraform-user"
                        }
                        # (4 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::771700505853:user/terraform-user",
                              - "arn:aws:iam::771700505853:user/Aws_admin_Sani",
                            ] -> "arn:aws:iam::771700505853:user/terraform-user"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::771700505853:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
                        }
                        Resource  = "*"
                        Sid       = "KeyServiceRolesASG"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "Environment" = "dev"
            "Terraform"   = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.eks.module.eks_managed_node_group["first"].aws_eks_node_group.this[0] will be updated in-place
  ~ resource "aws_eks_node_group" "this" {
        id                     = "dev-cluster:node-grp-1-20241124201437053700000021"
        tags                   = {
            "Environment"            = "dev"
            "Name"                   = "node-grp-1"
            "Terraform"              = "true"
            "karpenter.sh/discovery" = "dev-cluster"
        }
        # (16 unchanged attributes hidden)

      ~ scaling_config {
          ~ min_size     = 0 -> 1
            # (2 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Sanim16, Action: `pull_request`, Working Directory: ``, Workflow: `Infra setup`*